#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    РаботаСДокументамиСервер.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    Движения.ЗаказыКлиентов.Записывать = Истина;

    Для Каждого текСтрокаУслуги Из Услуги Цикл
        движение = Движения.ЗаказыКлиентов.Добавить();
        движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        движение.Период = Дата;
        движение.Клиент = Клиент;
        движение.ЗаписьКлиента = Ссылка;
        движение.Сумма = текСтрокаУслуги.Стоимость;
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
