#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    РаботаСДокументами.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    Движения.ЗаказыКлиентов.Записывать = Истина;

    движение = Движения.ЗаказыКлиентов.Добавить();
    движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    движение.Период = Дата;
    движение.Клиент = Клиент;
    движение.ЗаписьКлиента = Ссылка;
    движение.Сумма = Услуги.Итог("Стоимость");
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
