#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    РаботаСДокументамиСервер.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    Если Товары.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    Движения.ТоварыНаСкладах.Записывать = Истина;
    Для Каждого ТекСтрокаТовары Из Товары Цикл
        движение = Движения.ТоварыНаСкладах.Добавить();
        движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        движение.Период = Дата;
        движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
        движение.Склад = Склад;
        движение.Количество = ТекСтрокаТовары.Количество;
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
