Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
    сообщение = Новый СообщениеПользователю();
    сообщение.Текст = "Неверный формат ввода.";

    Если НЕ Справочники.Сотрудники.ВалидацияПолейФио(Фамилия) Тогда
        сообщение.Поле = "Фамилия";
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();
        проверяемыеРеквизиты.Удалить(проверяемыеРеквизиты.Найти(сообщение.Поле));
        отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ Справочники.Сотрудники.ВалидацияПолейФио(Имя) Тогда
        сообщение.Поле = "Имя";
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();
        проверяемыеРеквизиты.Удалить(проверяемыеРеквизиты.Найти(сообщение.Поле));
        отказ = Истина;
        Возврат;
    КонецЕсли;

    Если ЗначениеЗаполнено(Отчество) И НЕ Справочники.Сотрудники.ВалидацияПолейФио(Отчество) Тогда
        сообщение.Поле = "Отчество";
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();
        проверяемыеРеквизиты.Удалить(проверяемыеРеквизиты.Найти(сообщение.Поле));
        отказ = Истина;
        Возврат;
    КонецЕсли;
КонецПроцедуры
