#Область ПрограммныйИнтерфейс

// Возвращает значение цена для указанной номенклатуры
//
// Параметры:
//  номенклатура - СправочникСсылка.Номенклатура
//  видЦены - Перечисления.ВидыЦены - [опционально]
//  датаЦены - Дата - [опционально]
//
// Возвращаемое значение:
//  Число - в случае отсутствия данных о цене для указанных параметров - возвращает NULL
//
Функция ПолучитьЦенуПродажиНаДату(номенклатура, Знач видЦены = Неопределено, Знач датаЦены = Неопределено) Экспорт
    видЦены = ?(видЦены = Неопределено, Перечисления.ВидыЦены.Розничная, видЦены);

    запрос = Новый Запрос;
    запрос.Текст = "
        | ВЫБРАТЬ
        | 	ЦеныНоменклатуры.Цена КАК Цена
        | ИЗ
        | 	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
        |		&Период,
        |		Номенклатура = &Номенклатура
        |			И ВидЦены = &ВидЦены
        |	) КАК ЦеныНоменклатуры
        |";

    запрос.УстановитьПараметр("Номенклатура", номенклатура);
    запрос.УстановитьПараметр("Период", датаЦены);
    запрос.УстановитьПараметр("ВидЦены", видЦены);

    результатЗапроса = запрос.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат NULL;
    КонецЕсли;

    выборка = результатЗапроса.Выбрать();
    выборка.Следующий();

    Возврат выборка.Цена;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
