
&НаКлиенте
Процедура ПриОткрытии(_)
	ЭтотОбъект.ФормаПолученоСогласиеНаРегистрацию = ?(ЭтотОбъект.Объект.ПолученоСогласиеНаРегистрацию,
		"да", "нет");
КонецПроцедуры

&НаКлиенте
Процедура ФормаПолученоСогласиеНаРегистрациюПриИзменении(_)
	ЭтотОбъект.Объект.ПолученоСогласиеНаРегистрацию = ?(ЭтотОбъект.ФормаПолученоСогласиеНаРегистрацию = "да",
		Истина, Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.Объект.Исполнитель = ?(ЗначениеЗаполнено(ЭтотОбъект.Объект.Исполнитель), 
		ЭтотОбъект.Объект.Исполнитель, ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры
