#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
    ЭтотОбъект.ФормаПолученоСогласиеНаРегистрацию = ?(ЭтотОбъект.Объект.ПолученоСогласиеНаРегистрацию,
            "да", "нет");
КонецПроцедуры

&НаКлиенте
Процедура ФормаПолученоСогласиеНаРегистрациюПриИзменении(_)
    ЭтотОбъект.Объект.ПолученоСогласиеНаРегистрацию = ?(ЭтотОбъект.ФормаПолученоСогласиеНаРегистрацию = "да",
            Истина, Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(_, __)
    ЭтотОбъект.Объект.Исполнитель = ?(ЗначениеЗаполнено(ЭтотОбъект.Объект.Исполнитель),
            ЭтотОбъект.Объект.Исполнитель, ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьКартуМаршрута(_)
    формаМаршрута = ОткрытьФорму("ОбщаяФорма.ФормаПросмотраКартыМаршрута",
            Новый Структура("БизнесПроцессМаршрута", ЭтотОбъект.Объект.БизнесПроцесс),
            ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    формаМаршрута.Открыть();
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
