#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(_)
	Элементы.Услуги.ТекущиеДанные.СтатьяЗатрат = получитьСтатьюЗатрат();
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(_)
    обновитьСуммуПоСтрокеУслуги();
	обновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(_)
	обновитьСуммуПоСтрокеУслуги();
	обновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(_)
	обновитьСуммуДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУслуги

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//	СправочникСсылка.СтатьиЗатрат
&НаКлиенте
Функция получитьСтатьюЗатрат()
	номенклатура_ = Элементы.Услуги.ТекущиеДанные.Номенклатура;
	Возврат РаботаСЦенамиВызовСервера.ПолучитьСтатьюЗатратПоНоменклатуре(номенклатура_);
КонецФункции

&НаКлиенте
Процедура обновитьСуммуДокумента()
	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура обновитьСуммуПоСтрокеУслуги()
	строкаТчУслуги_ = Элементы.Услуги.ТекущиеДанные;
	строкаТчУслуги_.Сумма = строкаТчУслуги_.Количество * строкаТчУслуги_.Цена;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
