#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(_)
	Элементы.Услуги.ТекущиеДанные.СтатьяЗатрат = получитьСтатьюЗатрат();
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(_)
	обновитьСуммуПоСтрокеУслуги();
	обновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(_)
	обновитьСуммуПоСтрокеУслуги();
	обновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(_)
	обновитьСуммуДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУслуги

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//	СправочникСсылка.СтатьиЗатрат
&НаКлиенте
Функция получитьСтатьюЗатрат()
	номенклатура = Элементы.Услуги.ТекущиеДанные.Номенклатура;
	Возврат РаботаСЦенамиВызовСервера.ПолучитьСтатьюЗатратПоНоменклатуре(номенклатура);
КонецФункции

&НаКлиенте
Процедура обновитьСуммуДокумента()
	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура обновитьСуммуПоСтрокеУслуги()
	строкаТчУслуги = Элементы.Услуги.ТекущиеДанные;
	строкаТчУслуги.Сумма = строкаТчУслуги.Количество * строкаТчУслуги.Цена;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
