#Область ПрограммныйИнтерфейс

// Параметры:
//  документСсылка - ДокументСсылка.ПоступлениеУслуг
// Возвращаемое значение:
//  - ВыборкаИзРезультатаЗапроса, Неопределено  - Выборка Услуг документа с Итогами по СтатьямЗатрат
Функция ПолучитьВыборкуУслугПоСтатьямЗатрат(Знач документСсылка) Экспорт
    запросУслуг = Новый Запрос;
    запросУслуг.УстановитьПараметр("Ссылка", документСсылка);

    запросУслуг.Текст =
        "ВЫБРАТЬ
        |	ПоступлениеУслугУслуги.Номенклатура КАК Номенклатура,
        |	ПоступлениеУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
        |   ТаблНоменклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета,
        |	СУММА(ПоступлениеУслугУслуги.Сумма) КАК Сумма
        |ИЗ
        |	Документ.ПоступлениеУслуг.Услуги КАК ПоступлениеУслугУслуги
        |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблНоменклатура
        |       ПО (ТаблНоменклатура.Ссылка = ПоступлениеУслугУслуги.Номенклатура)
        |ГДЕ
        |	ПоступлениеУслугУслуги.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |   ПоступлениеУслугУслуги.СтатьяЗатрат,
        |   ПоступлениеУслугУслуги.Номенклатура,
        |   ТаблНоменклатура.СчетБухгалтерскогоУчета
        |ИТОГИ
        |	СУММА(Сумма)
        |ПО
        |	СтатьяЗатрат
        |";

    результатЗапроса = запросУслуг.Выполнить();

    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    выборка = результатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    Возврат выборка;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
