#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    РаботаСДокументами.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    Движения.УчетЗатрат.Записывать = Истина;

    выборкаУслугДокумента = получитьВыборкуУслугиДокумента();
    Если выборкаУслугДокумента = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Пока выборкаУслугДокумента.Следующий() Цикл
        выполнитьДвижениеУчетЗатрат(выборкаУслугДокумента);
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура выполнитьДвижениеУчетЗатрат(данныеЗатрат)
    движение = Движения.УчетЗатрат.Добавить();
    ЗаполнитьЗначенияСвойств(движение, данныеЗатрат);
    движение.Период = Дата;
КонецПроцедуры
#КонецОбласти // Движения

Функция получитьВыборкуУслугиДокумента()
    запросУслуг = Новый Запрос;
    запросУслуг.УстановитьПараметр("Ссылка", Ссылка);

    запросУслуг.Текст =
        "ВЫБРАТЬ
        |	ПоступлениеУслугУслуги.Ссылка КАК Регистратор,
        |	ПоступлениеУслуг.Дата КАК Период,
        |	ПоступлениеУслугУслуги.Номенклатура КАК Номенклатура,
        |	ПоступлениеУслугУслуги.Сумма КАК Сумма,
        |	ПоступлениеУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
        |	СУММА(ПоступлениеУслугУслуги.Цена) КАК Цена,
        |	ПоступлениеУслуг.Поставщик КАК Поставщик
        |ИЗ
        |	Документ.ПоступлениеУслуг.Услуги КАК ПоступлениеУслугУслуги
        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслуг КАК ПоступлениеУслуг
        |		ПО ПоступлениеУслугУслуги.Ссылка = ПоступлениеУслуг.Ссылка
        |ГДЕ
        |	ПоступлениеУслуг.Ссылка = &Ссылка
        |";
    
    результатЗапроса = запросУслуг.Выполнить();

    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    выборка = результатЗапроса.Выбрать();
    Возврат выборка;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
