#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(_, __)
    заполнитьРеквизитыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(_)
    установитьВидимостьПолейФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДенежныхСредствПриИзменении(_)
    показатьЗапросПользователюНаОчисткуПолейФормы("ТипДенежныхСредств");
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(_)
    показатьЗапросПользователюНаОчисткуПолейФормы("ВидОперации");
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(_)
    показатьЗапросПользователюНаОчисткуПолейФормы("Плательщик");
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура заполнитьРеквизитыФормы()
    этоНовыйОбъект = Объект.Ссылка.Пустая();

    Если этоНовыйОбъект Тогда
        Объект.ТипДенежныхСредств = ?(ЗначениеЗаполнено(Объект.ТипДенежныхСредств),
                Объект.ТипДенежныхСредств, Перечисления.ТипыДенежныхСредств.Наличные);
        Объект.ВидОперации = ?(ЗначениеЗаполнено(Объект.ВидОперации),
                Объект.ВидОперации, Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя);
    КонецЕсли;

    ЭтотОбъект.Плательщик = Объект.Плательщик;
    ЭтотОбъект.ТипДенежныхСредств = Объект.ТипДенежныхСредств;
    ЭтотОбъект.ВидОперации = Объект.ВидОперации;
КонецПроцедуры

&НаКлиенте
Процедура установитьВидимостьПолейФормы()

    Если Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
        Элементы.Касса.Видимость = Истина;
        Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
        
    ИначеЕсли Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
        Элементы.Касса.Видимость = Ложь;
        Элементы.ЭквайринговыйТерминал.Видимость = Истина;
    КонецЕсли;

    строкаТипПлательщика = получитьПредставлениеТипаПлательщика();

    Если строкаТипПлательщика = Неопределено Тогда
        Элементы.Плательщик.Видимость = Ложь;
        Элементы.ДоговорКонтрагента.Видимость = Ложь;
        Элементы.Касса.Видимость = Истина;
        Элементы.ЭквайринговыйТерминал.Видимость = Ложь;

    Иначе
        Если НЕ (строкаТипПлательщика = "СправочникСсылка.Сотрудники" ИЛИ строкаТипПлательщика = "СправочникСсылка.Банки") Тогда
            Элементы.ДоговорКонтрагента.Видимость =
                Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя");
            Элементы.Плательщик.Видимость = Истина;

        Иначе

            Элементы.ДоговорКонтрагента.Видимость = Ложь;
            Элементы.Плательщик.Видимость = Истина;
            Элементы.Касса.Видимость = Истина;
            Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
        КонецЕсли;

        списокДоступныхДляВыбораТипов = Новый Массив();
        списокДоступныхДляВыбораТипов.Добавить(Тип(строкаТипПлательщика));
        описаниеТипаПлательщика = Новый ОписаниеТипов(списокДоступныхДляВыбораТипов);
        Элементы.Плательщик.ОграничениеТипа = описаниеТипаПлательщика;
    КонецЕсли;

КонецПроцедуры

// Возвращаемое значение:
//	- Строка
//	- Неопределено
&НаКлиенте
Функция получитьПредставлениеТипаПлательщика() // => Строка | Неопределено
    строкаТипПлательщика = Неопределено;
    Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПрочееПоступление") Тогда
        Возврат строкаТипПлательщика;
    КонецЕсли;

    Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда
        строкаТипПлательщика = "СправочникСсылка.Сотрудники";
    ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке") Тогда
        строкаТипПлательщика = "СправочникСсылка.Банки";
    Иначе
        строкаТипПлательщика = "СправочникСсылка.Контрагенты";
    КонецЕсли;

    Возврат строкаТипПлательщика;
КонецФункции

&НаКлиенте
Процедура показатьЗапросПользователюНаОчисткуПолейФормы(Знач имяРеквизита)
    Если имяРеквизита = "ТипДенежныхСредств" Тогда
        показатьЗапросПользователюНаОчисткуПолейФормы_ПриИзмененииТипаДенежныхСредств("_приЗапросеНаИзменениеТипаДенежныхСредств_ОВ");
    ИначеЕсли имяРеквизита = "ВидОперации" Тогда
        показатьЗапросПользователюНаОчисткуПолейФормы_ПриИзмененииВидаОперации("_приЗапросеНаИзменениеВидаОперации_ОВ");
    ИначеЕсли имяРеквизита = "Плательщик" Тогда
        показатьЗапросПользователюНаОчисткуПолейФормы_ПриИзмененииПлательщика("_приЗапросеНаИзменениеПлательщика_ОВ");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция сформироватьТекстЗапросаОчисткиПолей(Знач имяРеквизита, массивОчищаемыхРеквизитов) // => Строка | Неопределено
    Если массивОчищаемыхРеквизитов = Неопределено ИЛИ массивОчищаемыхРеквизитов.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;

    текстВопроса_ = СтрШаблон("При изменении реквизита ""%1"" будут очищены следующие данные:", имяРеквизита);

    Для Каждого поле Из массивОчищаемыхРеквизитов Цикл
        текстВопроса_ = текстВопроса_ + "
            | - %1";

        текстВопроса_ = СтрШаблон(текстВопроса_, поле);
    КонецЦикла;

    Если ЗначениеЗаполнено(массивОчищаемыхРеквизитов) Тогда
        текстВопроса_ = текстВопроса_ + "
            | Продолжить?";
    Иначе
        текстВопроса_ = Неопределено;
    КонецЕсли;

    Возврат текстВопроса_;
КонецФункции

// Открывает форму диалогового окна для подтверждения очистки ранее заполненных значений полей формы.\
// Вызывается при изменении значения поля формы: ТипаДенежныхСредств
//
// Параметры:
//	обратныйВызов - Строка - имя функции обратного вызова для обработки события: закрытие диалогового окна
//		по умолчанию - _приЗапросеНаИзменениеТипаДенежныхСредств_ОВ
&НаКлиенте
Процедура показатьЗапросПользователюНаОчисткуПолейФормы_ПриИзмененииТипаДенежныхСредств(обратныйВызов =
        "_приЗапросеНаИзменениеТипаДенежныхСредств_ОВ")
    имяРеквизита = "ТипДенежныхСредств";
    массивОчищаемыхРеквизитов = Новый Массив;

    Если этоОплатаНаличными() И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда
        массивОчищаемыхРеквизитов.Добавить("ЭквайринговыйТерминал");
    ИначеЕсли этоОплатаБезналичными() И ЗначениеЗаполнено(Объект.Касса) Тогда
        массивОчищаемыхРеквизитов.Добавить("Касса");
    КонецЕсли;

    текстВопроса = сформироватьТекстЗапросаОчисткиПолей(имяРеквизита, массивОчищаемыхРеквизитов);

    Если текстВопроса <> Неопределено Тогда
        оповещение = Новый ОписаниеОповещения(обратныйВызов, ЭтотОбъект, массивОчищаемыхРеквизитов);
        ПоказатьВопрос(оповещение, текстВопроса, РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Иначе
        ЭтотОбъект.ТипДенежныхСредств = Объект.ТипДенежныхСредств;
        установитьВидимостьПолейФормы();
    КонецЕсли;
КонецПроцедуры

// Открывает форму диалогового окна для подтверждения очистки ранее заполненных значений полей формы.\
// Вызывается при изменении значения поля формы: ВидаОперации
//
// Параметры:
//	обратныйВызов - Строка - имя функции обратного вызова для обработки события: закрытие диалогового окна
&НаКлиенте
Процедура показатьЗапросПользователюНаОчисткуПолейФормы_ПриИзмененииВидаОперации(обратныйВызов = "_приЗапросеНаИзменениеВидаОперации_ОВ")
    имяРеквизита = "ВидОперации";
    массивОчищаемыхРеквизитов = Новый Массив;

    одноИзОчищаемыхПолейЗаполнено = ЗначениеЗаполнено(Объект.Плательщик) ИЛИ ЗначениеЗаполнено(Объект.ДоговорКонтрагента);

    Если одноИзОчищаемыхПолейЗаполнено Тогда
        Если (этоВозвратОтПодотчетника() ИЛИ этоПолучениеНаличныхВБанке()) И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
            массивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");

        ИначеЕсли этоПрочееПоступление() Тогда
            Если ЗначениеЗаполнено(Объект.Плательщик) Тогда
                массивОчищаемыхРеквизитов.Добавить("Плательщик");
            КонецЕсли;
            Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
                массивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;

    текстВопроса = сформироватьТекстЗапросаОчисткиПолей(имяРеквизита, массивОчищаемыхРеквизитов);

    Если текстВопроса <> Неопределено Тогда
        оповещение = Новый ОписаниеОповещения(обратныйВызов, ЭтотОбъект, массивОчищаемыхРеквизитов);
        ПоказатьВопрос(оповещение, текстВопроса, РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Иначе
        // Поля для очистки не заполнены или ВидОперации не входит в диапазон значений
        ЭтотОбъект.ВидОперации = Объект.ВидОперации;
        установитьВидимостьПолейФормы();
        Возврат; // Оповещение пользователю не показываем
    КонецЕсли;
КонецПроцедуры

// Открывает форму диалогового окна для подтверждения очистки ранее заполненных значений полей формы.\
// Вызывается при изменении значения поля формы: Плательщик
//
// Параметры:
//	обратныйВызов - Строка - имя функции обратного вызова для обработки события: закрытие диалогового окна
&НаКлиенте
Процедура показатьЗапросПользователюНаОчисткуПолейФормы_ПриИзмененииПлательщика(обратныйВызов = "_приЗапросеНаИзменениеПлательщика_ОВ")
    имяРеквизита = "Плательщик";
    массивОчищаемыхРеквизитов = Новый Массив;

    этоКлиент = этоКлиент(Объект.Плательщик);
    массивОчищаемыхРеквизитов = Новый Массив;

    Если этоКлиент И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
        массивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
    КонецЕсли;

    текстВопроса = сформироватьТекстЗапросаОчисткиПолей(имяРеквизита, массивОчищаемыхРеквизитов);

    Если текстВопроса <> Неопределено Тогда
        оповещение = Новый ОписаниеОповещения(обратныйВызов, ЭтотОбъект, массивОчищаемыхРеквизитов);
        ПоказатьВопрос(оповещение, текстВопроса, РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Иначе
        ЭтотОбъект.Плательщик = Объект.Плательщик;
        установитьВидимостьПолейФормы();
    КонецЕсли;
КонецПроцедуры

// Выполняет очистку ранее заполненных значений полей формы
//
// Параметры:
//	поляДляОчистки - Массив - Массив имен полей (реквизитов) для очистки
&НаКлиенте
Процедура очиститьНеиспользуемыеРеквизитыФормы(поляДляОчистки)
    Для Каждого имяРеквизита Из поляДляОчистки Цикл
        Объект[имяРеквизита] = Неопределено;
    КонецЦикла;
    установитьВидимостьПолейФормы();
КонецПроцедуры

#Область СлужебныеПоля
// Параметры:
//	плательщикСсылка - СправочникСсылка.Контрагенты
//
// Возвращаемое значение:
//	- Булево
&НаСервереБезКонтекста
Функция этоКлиент(Знач плательщикСсылка) // => Булево

    Если ТипЗнч(плательщикСсылка) <> Тип("СправочникСсылка.Контрагенты") Тогда
        Возврат Ложь;
    КонецЕсли;

    запросКонтрагента = Новый Запрос;
    запросКонтрагента.УстановитьПараметр("ПлательщикСсылка", плательщикСсылка);

    запросКонтрагента.Текст =
        "ВЫБРАТЬ
        |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
        |	Контрагенты.Ссылка КАК Контрагент
        |ИЗ
        |	Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |	Контрагенты.Ссылка = &ПлательщикСсылка
        |";

    выборка = запросКонтрагента.Выполнить().Выбрать();
    выборка.Следующий();

    Если ЗначениеЗаполнено(выборка.ТипКонтрагента)
        И выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
        Возврат Истина;
    Иначе
        Возврат Ложь;
    КонецЕсли;
КонецФункции

&НаКлиенте
Функция этоОплатаНаличными() // => Булево
    Возврат Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные");
КонецФункции

&НаКлиенте
Функция этоОплатаБезналичными() // => Булево
    Возврат Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные");
КонецФункции

&НаКлиенте
Функция этоПрочееПоступление() // => Булево
    Возврат Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПрочееПоступление");
КонецФункции

&НаКлиенте
Функция этоВозвратОтПодотчетника() // => Булево
    Возврат Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника");
КонецФункции

&НаКлиенте
Функция этоПолучениеНаличныхВБанке() // => Булево
    Возврат Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке");
КонецФункции
#КонецОбласти // СлужебныеПоля

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийДиалоговФормы
// Функция обратного вызова.\
// Вызывается после закрытия диалогового окна с запросом подтверждения очистки неиспользуемых полей
// при изменении значения поля формы: ТипДенежныхСредств
//
// Параметры:
//	кодВозврата - КодВозвратаДиалога
//	поляДляОчистки - Массив - Массив имен полей которые должны быть очищены
&НаКлиенте
Процедура _приЗапросеНаИзменениеТипаДенежныхСредств_ОВ(Знач кодВозврата, поляДляОчистки) Экспорт
    Если кодВозврата = КодВозвратаДиалога.Да Тогда
        очиститьНеиспользуемыеРеквизитыФормы(поляДляОчистки);
        ЭтотОбъект.ТипДенежныхСредств = Объект.ТипДенежныхСредств;
    Иначе
        Объект.ТипДенежныхСредств = ЭтотОбъект.ТипДенежныхСредств;
    КонецЕсли;
КонецПроцедуры

// Функция обратного вызова.\
// Вызывается после закрытия диалогового окна с запросом подтверждения очистки неиспользуемых полей
// при изменении значения поля формы: ВидОперации
//
// Параметры:
//	кодВозврата - КодВозвратаДиалога
//	поляДляОчистки - Массив - Массив имен полей которые должны быть очищены
&НаКлиенте
Процедура _приЗапросеНаИзменениеВидаОперации_ОВ(Знач кодВозврата, поляДляОчистки) Экспорт
    Если кодВозврата = КодВозвратаДиалога.Да Тогда
        очиститьНеиспользуемыеРеквизитыФормы(поляДляОчистки);
        ЭтотОбъект.ВидОперации = Объект.ВидОперации;
    Иначе
        Объект.ВидОперации = ЭтотОбъект.ВидОперации;
    КонецЕсли;
КонецПроцедуры

// Функция обратного вызова.\
// Вызывается после закрытия диалогового окна с запросом подтверждения очистки неиспользуемых полей
// при изменении значения поля формы: ВидОперации
//
// Параметры:
//	кодВозврата - КодВозвратаДиалога
//	поляДляОчистки - Массив - Массив имен полей которые должны быть очищены
&НаКлиенте
Процедура _приЗапросеНаИзменениеПлательщика_ОВ(Знач кодВозврата, поляДляОчистки) Экспорт
    Если кодВозврата = КодВозвратаДиалога.Да Тогда
        очиститьНеиспользуемыеРеквизитыФормы(поляДляОчистки);
        ЭтотОбъект.Плательщик = Объект.Плательщик;
    Иначе
        Объект.Плательщик = ЭтотОбъект.Плательщик;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти // ФункцииОбратногоВызова

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
