#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПриОткрытии(_)
	установитьВидимость(Элементы.ГлавныйБухгалтер);
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(_)
	установитьВидимость(Элементы.ГлавныйБухгалтер);
КонецПроцедуры
#КонецОбласти // ОбработчикиСобытий

#Область Утилиты
&НаКлиенте
Процедура установитьВидимость(элементФормы)
	Если элементФормы = Элементы.ГлавныйБухгалтер Тогда
		элементФормы.Видимость = этоЮридическоеЛицо();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция этоЮридическоеЛицо()
	Возврат Объект.ТипОрганизации = Перечисления.ТипыОрганизаций.ЮридическоеЛицо;
КонецФункции
#КонецОбласти // Утилиты

#КонецОбласти // СлужебныеПроцедурыИФункции
