#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
	настроитьПоляФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(_)
	настроитьПоляФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

// Выполняет настройку отображения полей формы в зависимости от выбранного ТипаОрганизации (НаКлиенте)
&НаКлиенте
Процедура настроитьПоляФормы()
	Элементы.ГлавныйБухгалтер.Видимость = этоЮридическоеЛицо();
КонецПроцедуры

// Определяет является ли текущая запись организации типом - ЮридическоеЛицо (НаКлиенте)
// Возвращаемое значение:
// 	Булево
&НаКлиенте
Функция этоЮридическоеЛицо()
	Возврат Объект.ТипОрганизации = получитьЗначениеТипаОрганизации("ЮридическоеЛицо");
КонецФункции

// Получить значение типа организации (НаКлиенте)
// Параметры:
//	имяТипаОрганизации - Строка - строковое значение из Перечисления.ТипыОрганизаций
// Возвращаемое значение:
// 	Перечисления.ТипыОрганизаций
&НаКлиенте
Функция получитьЗначениеТипаОрганизации(имяТипаОрганизации)
	Возврат ПредопределенноеЗначение(СтрШаблон("Перечисление.ТипыОрганизаций.%1", имяТипаОрганизации));
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
