#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(_, __)
    Параметры.Свойство("БизнесПроцессМаршрута", ЭтотОбъект.БизнесПроцессМаршрута);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(_)
    ЭтотОбъект.Элементы.ОбновитьМаршрут.Доступность = ЗначениеЗаполнено(ЭтотОбъект.БизнесПроцессМаршрута);
    ОбновитьМаршрут(Неопределено);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура БизнесПроцессМаршрутаПриИзменении(_)
    ЭтотОбъект.Элементы.ОбновитьМаршрут.Доступность = ЗначениеЗаполнено(ЭтотОбъект.БизнесПроцессМаршрута);
    ОбновитьМаршрут(Неопределено);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийШапкиФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьМаршрут(_)
    Если ЗначениеЗаполнено(ЭтотОбъект.БизнесПроцессМаршрута) Тогда
        ЭтотОбъект.КартаМаршрута = получитьКартуМаршрутаНаСервере(ЭтотОбъект.БизнесПроцессМаршрута);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция получитьКартуМаршрутаНаСервере(Знач бизнесПроцессСсылка)
    ДиагностикаКлиентСервер.Утверждение(бизнесПроцессСсылка <> Неопределено);

    Возврат бизнесПроцессСсылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
