#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьМаршрут(_)
    ЭтотОбъект.КартаМаршрута = получитьКартуМаршрутаНаСервере(ЭтотОбъект.БизнесПроцессМаршрута);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция получитьКартуМаршрутаНаСервере(Знач бизнесПроцессСсылка)
    ДиагностикаКлиентСервер.Утверждение(бизнесПроцессСсылка <> Неопределено);

    Возврат бизнесПроцессСсылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
