#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(данныеЗаполнения, __, ___)
    РаботаСДокументами.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    выполнитьВсеДвижения();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура выполнитьВсеДвижения()
    Движения.ЦеныНоменклатурыПоставщиков.Записывать = Истина;

    Для Каждого текСтрокаТовары Из Товары Цикл
        выполнитьДвижениеЦеныНоменклатурыПоставщиков(текСтрокаТовары);
    КонецЦикла;
КонецПроцедуры

Процедура выполнитьДвижениеЦеныНоменклатурыПоставщиков(Знач товар)
    движение = Движения.ЦеныНоменклатурыПоставщиков.Добавить();

    движение.Период = ЭтотОбъект.Дата;
    движение.Поставщик = ЭтотОбъект.Контрагент;
    движение.Номенклатура = товар.Номенклатура;
    движение.Цена = товар.Цена;
КонецПроцедуры
#КонецОбласти // Движения

#КонецОбласти // СлужебныеПроцедурыИФункции
