#Область ПрограммныйИнтерфейс

// Возвращает ссылку на документ РеализацияТоваровИУслуг созданный на основании документОснованиеСсылка.\
// Документ РеализацияТоваровИУслуг должен иметь статус: Проведен
//
// Параметры:
//	документОснованиеСсылка - ДокументСсылка.ЗаписьКлиента
//	типДокументаРеализации - Тип, Неопределено
//
// Возвращаемое значение:
//	- ДокументСсылка.РеализацияТоваровИУслуг, Неопределено
//
Функция ПолучитьДокументРеализацииНаОсновании(Знач документОснованиеСсылка, типДокументаРеализации = Неопределено) Экспорт
    Если НЕ ЗначениеЗаполнено(документОснованиеСсылка) Тогда
        Возврат Неопределено;
    КонецЕсли;

    типДокументаРеализацииПоУмолчанию = Тип("ДокументСсылка.РеализацияТоваровИУслуг");
    типДокументаРеализации = ?(типДокументаРеализации = Неопределено, типДокументаРеализации,
            типДокументаРеализацииПоУмолчанию);

    этоДопустимыйТипДокумента = типДокументаРеализации = типДокументаРеализацииПоУмолчанию;
    Если НЕ этоДопустимыйТипДокумента Тогда
        Возврат Неопределено;
    КонецЕсли;

    запросДокументаРеализации = Новый Запрос;
    запросДокументаРеализации.УстановитьПараметр("Ссылка", документОснованиеСсылка);

    текстЗапроса =
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |	ДокументРеализация.Ссылка КАК Ссылка
        |ИЗ
        |	Документ.РеализацияТоваровИУслуг КАК ДокументРеализация
        |ГДЕ
        |	ДокументРеализация.ДокументОснование = &Ссылка
        |		И ДокументРеализация.Проведен
        |";

    текстЗапроса = ?(типДокументаРеализации = типДокументаРеализацииПоУмолчанию, текстЗапроса,
            СтрЗаменить(текстЗапроса,
                Метаданные.НайтиПоТипу(типДокументаРеализацииПоУмолчанию).Имя,
                Метаданные.НайтиПоТипу(типДокументаРеализации).Имя));

    запросДокументаРеализации.Текст = текстЗапроса;

    результатЗапроса = запросДокументаРеализации.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    выборка = результатЗапроса.Выбрать();
    выборка.Следующий();

    Возврат выборка.Ссылка;

КонецФункции

Функция ПолучитьТипыДенежныхСредств() Экспорт
    Возврат РаботаСДокументами.ПолучитьТипыДенежныхСредств();
КонецФункции

Функция ПолучитьПолучитьВидыОперацийПоступленияДенег() Экспорт
    Возврат РаботаСДокументами.ПолучитьВидыОперацийПоступленияДенег();
КонецФункции

// Возвращаемое значение:
//	- СправочникСсылка.Кассы, Неопределено
Функция ПолучитьКассуПоУмолчанию() Экспорт
    Возврат Справочники.Кассы.ПолучитьОсновнуюКассу();
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
