#Область ПрограммныйИнтерфейс

// Устарело. Не используется в текущей реализации. Не тестировалось.
// Получает Структуру предопределенных групп Номенклатуры.\
//
// Возвращаемое значение:
//  - ФиксированнаяСтруктура
Функция ПолучитьГруппыНоменклатуры() Экспорт
    группы = Новый Структура;
    столбцы = "Группа, ТипНоменклатуры";

    группы.Вставить("Материалы",
        Новый Структура(столбцы, Материалы, Перечисления.ТипыНоменклатуры.Материал));
    группы.Вставить("Товары",
        Новый Структура(столбцы, Товары, Перечисления.ТипыНоменклатуры.Товар));
    группы.Вставить("Услуги",
        Новый Структура(столбцы, Услуги, Перечисления.ТипыНоменклатуры.Услуга));

    Возврат Новый ФиксированнаяСтруктура(группы);
КонецФункции

// Возвращаемое значение:
//	- Структура
Функция ПолучитьТипыНоменклатуры() Экспорт
    результат = РаботаСМетаданными.ПолучитьЗначенияПеречисления(Тип("ПеречислениеСсылка.ТипыНоменклатуры"));
    Если результат = Неопределено Тогда
        ВызватьИсключение "Ошибка при получении значений перечисления ""ТипыНоменклатуры"".";
    КонецЕсли;

    ДиагностикаКлиентСервер.Утверждение(ТипЗнч(результат) = Тип("Структура") И ЗначениеЗаполнено(результат),
            "Структура значений перечисления ""ТипыНоменклатуры"" не соответствует ожиданию.
            |Структура значений должна иметь тип ""Структура"" и быть заполненной.",
            "Справочники.Номенклатура.МодульМенеджера.ПолучитьТипыНоменклатуры");

    Возврат результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
