#Область ПрограммныйИнтерфейс

// Получает Структуру предопределенных групп Номенклатуры.\
// [прим разработчика]: Не используется в текущей реализации
//
// Возвращаемое значение:
//  Структура
Функция ПолучитьГруппыНоменклатуры() Экспорт
    группы = Новый Структура;

    группы.Вставить("Материалы",
        Новый Структура("Группа, ТипНоменклатуры", Материалы, Перечисления.ТипыНоменклатуры.Материал));
    группы.Вставить("Товары",
        Новый Структура("Группа, ТипНоменклатуры", Товары, Перечисления.ТипыНоменклатуры.Товар));
    группы.Вставить("Услуги",
        Новый Структура("Группа, ТипНоменклатуры", Услуги, Перечисления.ТипыНоменклатуры.Услуга));

    Возврат группы;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
