#Область ПрограммныйИнтерфейс

// Параметры:
//	имя - Строка
//	получитьВсеЗаписи - Булево
// Возвращаемое значение:
//	- Структура
//		* Ссылка - СправочникСсылка.Пользователи
//		* Код - Строка
//	- Массив Из Структура
//		* Ссылка - СправочникСсылка.Пользователи
//		* Код - Строка
//	- Неопределено
Функция НайтиПользователя(Знач имя, Знач получитьВсеЗаписи = Ложь) Экспорт
	запрос = Новый Запрос;
	запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Код КАК Код
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование = &Имя
		|";

	запрос.УстановитьПараметр("Имя", имя);
	результатЗапроса = запрос.Выполнить();

	Если результатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	тзПользователи = результатЗапроса.Выгрузить();
	пользователь_ключи = "Ссылка, Код";
	Если получитьВсеЗаписи = Ложь Тогда
		пользователь = тзПользователи[0];
		Возврат Новый Структура(пользователь_ключи, пользователь.Ссылка, пользователь.Код);
	КонецЕсли;

	результат = Новый Массив;
	Для Каждого пользовательКЗ Из тзПользователи Цикл
		результат.Вставить(Новый Структура(пользователь_ключи, пользовательКЗ.Ссылка, пользовательКЗ.Код));
	КонецЦикла;

	Возврат результат;
КонецФункции

#КонецОбласти
