#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  Массив - массив объектов вида: { ИмяТЧ: Строка, Столбец: Строка } наименований
// 	табличных частей (ТЧ) и столбцов ТЧ используемых для расчета суммы документа.
//	{ ИмяТЧ - Имя ТабличнойЧасти, Столбец - Наименование Реквизита ТабличнойЧасти }
//
Функция ПолучитьПоляДляРасчетаСуммыДокумента() Экспорт
    имяТаблицыТоваров = Метаданные.Документы.ПоступлениеТоваров.ТабличныеЧасти.Товары.Имя;

    коллекцияПолей = Новый Массив(1);
    коллекцияПолей[0] = РаботаСДокументамиКлиентСервер.СоздатьЭлементРасчетаСуммыДокумента(имяТаблицыТоваров, "Сумма");

    Возврат коллекцияПолей;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
