Процедура УстановкаПараметровСеанса(именаПараметровСеанса)
	Если именаПараметровСеанса <> Неопределено Тогда
		установленныеПараметры = Новый Массив;
		Для Каждого имяПараметра Из именаПараметровСеанса Цикл
			УстановитьЗначениеПараметраСеанса(имяПараметра, установленныеПараметры);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(Знач имяПараметра, установленныеПараметры)
	Если установленныеПараметры.Найти(имяПараметра) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если имяПараметра = "ТекущийПользователь" Тогда
		пользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		Если пользовательИБ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		текущийПользователь = Справочники.Пользователи.НайтиПоКоду(пользовательИБ.УникальныйИдентификатор);
		
		Если текущийПользователь.Пустая() Тогда
			пользователь = Справочники.Пользователи.СоздатьЭлемент();
			пользователь.Код = пользовательИБ.УникальныйИдентификатор;
			пользователь.Наименование = пользовательИБ.Имя;
			пользователь.Записать();
			текущийПользователь = пользователь.Ссылка;
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = текущийПользователь;
	КонецЕсли;
	
	установленныеПараметры.Добавить(имяПараметра);
КонецПроцедуры