#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(_, __)
    рассчитатьСуммуДокумента();
    записатьАвтораДокументаНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(_)
    рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(_)
    рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТовары

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиСтоимостьПриИзменении(_)
    рассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУслуги

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура рассчитатьСуммуПоСтрокеТовары()
    текущСтрокаТовары = Элементы.Товары.ТекущиеДанные;
    текущСтрокаТовары.Сумма = текущСтрокаТовары.Цена * текущСтрокаТовары.Количество;
    рассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммуДокумента()
    Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Стоимость");
КонецПроцедуры

// Записывает значение АвтораДокумента - как ТекущийПользователь при первой записи документа.\
// При повторных записях (если значение заполнено) АвтораДокумента не меняется
&НаСервере
Процедура записатьАвтораДокументаНаСервере()
    Объект.АвторДокумента = ?(ЗначениеЗаполнено(Объект.АвторДокумента),
            Объект.АвторДокумента, ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
