#Область ОбъявлениеПеременных
&НаКлиенте
Перем _СуммаДокументаУстарелаПоУслугам;
&НаКлиенте
Перем _СуммаДокументаУстарелаПоТоварам;

&НаКлиенте
Перем _ТекСтоимостьУслуг;
&НаКлиенте
Перем _ТекСтоимостьТоваров;
#КонецОбласти

#Область Утилиты
&НаКлиенте
Функция ПолучитьСуммаДокументаУстарела()
    Возврат _СуммаДокументаУстарелаПоУслугам ИЛИ _СуммаДокументаУстарелаПоТоварам;
КонецФункции

&НаКлиенте
Процедура УстановитьСуммаДокументаУстарела(Услуга, Товар)
    Если НЕ Услуга = Неопределено Тогда
        _СуммаДокументаУстарелаПоУслугам = Услуга;
    КонецЕсли;
    Если НЕ Товар = Неопределено Тогда
        _СуммаДокументаУстарелаПоТоварам = Товар;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция РасчитатьСтоимостьУсулуг()
    СтоимостьУсулуг = 0.0;
    Услуги = Объект.Услуги;

    Для Каждого стрУслуга Из Услуги Цикл
        СтоимостьУсулуг = СтоимостьУсулуг + стрУслуга.Стоимость;
    КонецЦикла;

    Возврат СтоимостьУсулуг;
КонецФункции

&НаКлиенте
Функция РасчитатьСтоимостьТоваров()
    СтоимостьТоваров = 0.0;
    Товары = Объект.Товары;

    Для Каждого стрТовар Из Товары Цикл
        СтоимостьТоваров = СтоимостьТоваров + стрТовар.Сумма;
    КонецЦикла;

    Возврат СтоимостьТоваров;
КонецФункции

&НаКлиенте
Функция ПолучитьСтоимостьТоваров(СтрокаУслуга)
    Возврат СтрокаУслуга.Количество * СтрокаУслуга.Цена;
КонецФункции

&НаКлиенте
Процедура ОбновитьСуммуДокумента()
    НоваяСтоимостьТоваров = 0.0;
    НоваяСтоимостьУслуг = 0.0;

    Если _СуммаДокументаУстарелаПоТоварам = Истина Тогда
        Товары = Объект.Товары;
        Для Каждого стрТовар Из Товары Цикл
            НоваяСтоимостьТоваров = НоваяСтоимостьТоваров + стрТовар.Сумма;
        КонецЦикла;
        _ТекСтоимостьТоваров = НоваяСтоимостьТоваров;
    Иначе
        НоваяСтоимостьТоваров = _ТекСтоимостьТоваров;
    КонецЕсли;

    Если _СуммаДокументаУстарелаПоУслугам = Истина Тогда
        Услуги = Объект.Услуги;
        Для Каждого стрУслуга Из Услуги Цикл
            НоваяСтоимостьУслуг = НоваяСтоимостьУслуг + стрУслуга.Стоимость;
        КонецЦикла;
        _ТекСтоимостьУслуг = НоваяСтоимостьУслуг;
    Иначе
        НоваяСтоимостьУслуг = _ТекСтоимостьУслуг;
    КонецЕсли;

    Объект.СуммаДокумента = НоваяСтоимостьТоваров + НоваяСтоимостьУслуг;
    УстановитьСуммаДокументаУстарела(Ложь, Ложь);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытииФормы(Элемент)
    УстановитьСуммаДокументаУстарела(Ложь, Ложь);
    _ТекСтоимостьУслуг = РасчитатьСтоимостьУсулуг();
    _ТекСтоимостьТоваров = РасчитатьСтоимостьТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    СтрокаТабличнойЧасти.Сумма = ПолучитьСтоимостьТоваров(СтрокаТабличнойЧасти);
    УстановитьСуммаДокументаУстарела( , Истина);
    ОбновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    СтрокаТабличнойЧасти.Сумма = ПолучитьСтоимостьТоваров(СтрокаТабличнойЧасти);
    УстановитьСуммаДокументаУстарела( , Истина);
    ОбновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьПриИзменении(Элемент)
    УстановитьСуммаДокументаУстарела(Истина, );
    ОбновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
    УстановитьСуммаДокументаУстарела( , Истина);
    ОбновитьСуммуДокумента();
КонецПроцедуры
#КонецОбласти
