#Область ОписаниеПеременных

&НаКлиенте
Перем _ПоляРасчетаСуммыДокумента;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
	_ПоляРасчетаСуммыДокумента = получитьПоляИтогов();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(_, __)
    рассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(_)
    рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(_)
    рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТовары

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиСтоимостьПриИзменении(_)
    рассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУслуги

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура рассчитатьСуммуПоСтрокеТовары()
    текущСтрокаТовары = Элементы.Товары.ТекущиеДанные;
    текущСтрокаТовары.Сумма = текущСтрокаТовары.Цена * текущСтрокаТовары.Количество;
    рассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммуДокумента()
    //~ Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Стоимость");
    сумма = 0.0;
    Для каждого таблица Из _ПоляРасчетаСуммыДокумента Цикл
        сумма = сумма + Объект[таблица.ИмяТЧ].Итог(таблица.Столбец);
    КонецЦикла;

    Объект.СуммаДокумента = сумма;
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьПоляИтогов()
    Возврат Документы.РеализацияТоваровИУслуг.ПолучитьПоляДляРасчетаСуммыДокумента();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
