#Область ОбъявлениеПеременных
&НаКлиенте
Перем _СуммаДокументаУстарелаПоУслугам;
&НаКлиенте
Перем _СуммаДокументаУстарелаПоТоварам;

&НаКлиенте
Перем _ПредСтоимостьУслуг;
&НаКлиенте
Перем _ПредСтоимостьТоваров;
#КонецОбласти

#Область Утилиты
&НаКлиенте
Функция ПолучитьСуммаДокументаУстарела()
    Возврат _СуммаДокументаУстарелаПоУслугам ИЛИ _СуммаДокументаУстарелаПоТоварам;
КонецФункции

&НаКлиенте
Процедура УстановитьСуммаДокументаУстарела(Услуга = Неопределено, Товар = Неопределено)
    Если НЕ Услуга = Неопределено Тогда
        _СуммаДокументаУстарелаПоУслугам = Услуга;
    КонецЕсли;
    Если НЕ Товар = Неопределено Тогда
        _СуммаДокументаУстарелаПоТоварам = Товар;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция РассчитатьСтоимостьУслуг()
    стоимостьУслуг = 0.0;
    Услуги = Объект.Услуги;

    Для Каждого стрУслуга Из Услуги Цикл
        стоимостьУслуг = стоимостьУслуг + стрУслуга.Стоимость;
    КонецЦикла;

    Возврат стоимостьУслуг;
КонецФункции

&НаКлиенте
Функция РассчитатьСтоимостьТоваров()
    СтоимостьТоваров = 0.0;
    Товары = Объект.Товары;

    Для Каждого стрТовар Из Товары Цикл
        СтоимостьТоваров = СтоимостьТоваров + стрТовар.Сумма;
    КонецЦикла;

    Возврат СтоимостьТоваров;
КонецФункции

&НаКлиенте
Функция ПолучитьСтоимостьТоваров(СтрокаУслуга)
    Возврат СтрокаУслуга.Количество * СтрокаУслуга.Цена;
КонецФункции

&НаКлиенте
Процедура ОбновитьСуммуДокумента()
    Если _СуммаДокументаУстарелаПоТоварам = Истина Тогда
        _ПредСтоимостьТоваров = РассчитатьСтоимостьТоваров();
    КонецЕсли;

    Если _СуммаДокументаУстарелаПоУслугам = Истина Тогда
        _ПредСтоимостьУслуг = РассчитатьСтоимостьУслуг();
    КонецЕсли;

    Объект.СуммаДокумента = _ПредСтоимостьТоваров + _ПредСтоимостьУслуг;
    УстановитьСуммаДокументаУстарела(Ложь, Ложь);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытииФормы(Элемент)
    УстановитьСуммаДокументаУстарела(Ложь, Ложь);
    _ПредСтоимостьУслуг = РассчитатьСтоимостьУслуг();
    _ПредСтоимостьТоваров = РассчитатьСтоимостьТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    СтрокаТабличнойЧасти.Сумма = ПолучитьСтоимостьТоваров(СтрокаТабличнойЧасти);
    УстановитьСуммаДокументаУстарела( , Истина);
    ОбновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    СтрокаТабличнойЧасти.Сумма = ПолучитьСтоимостьТоваров(СтрокаТабличнойЧасти);
    УстановитьСуммаДокументаУстарела( , Истина);
    ОбновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьПриИзменении(Элемент)
    УстановитьСуммаДокументаУстарела(Истина, );
    ОбновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
    УстановитьСуммаДокументаУстарела( , Истина);
    ОбновитьСуммуДокумента();
КонецПроцедуры
#КонецОбласти
