#Область ПрограммныйИнтерфейс

// Функция обертка для "ЗаменитьПоРегулярномуВыражению".\
// Используется для вызова на стороне клиента
//
// Параметры:
//  исходнаяСтрока - Строка - исходная строка
//  выражение - Строка - выражение для поиска
//  подстрокаЗамены - Строка - подстрока замены
//  игнорироватьРегистр - Булево - по умолчанию = Ложь
//
// Возвращаемое значение:
//  Строка
Функция ЗаменитьПоРегулярномуВыражению(Знач исходнаяСтрока, Знач выражение,
        Знач подстрокаЗамены, Знач игнорироватьРегистр = Ложь) Экспорт
    Возврат СтрЗаменитьПоРегулярномуВыражению(исходнаяСтрока, выражение, подстрокаЗамены, игнорироватьРегистр);
КонецФункции

// Функция обертка для "СтрНайтиПоРегулярномуВыражению".\
// Используется для вызова на стороне клиента
//
// Параметры:
//  исходнаяСтрока - Строка - исходная строка
//  выражение - Строка - выражение для поиска
//
// Возвращаемое значение:
//  РезультатПоискаПоРегулярномуВыражению
Функция НайтиПоРегулярномуВыражению(Знач исходнаяСтрока, Знач выражение) Экспорт
    Возврат СтрНайтиПоРегулярномуВыражению(исходнаяСтрока, выражение);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
