#Область ПрограммныйИнтерфейс

// Выполняет расчет суммы документа
//
// Параметры:
//  объект - Структура - представление записи таблицы
//  опцииРасчета - Массив - массив объектов с обязательными полями типа: { ИмяТЧ: Строка, Столбец: Строка },
//      где ИмяТЧ - наименование ТабличнойЧасти, Столбец - наименование столбца
//      прим. поляРасчета = { ИмяТЧ: "Товары", Столбец: "Сумма" }
//
//  Возвращаемое значение:
//      Число - сумма документа
//
Функция РассчитатьСуммуДокумента(объект, опцииРасчета) Экспорт
    сумма = 0.0;
    Для Каждого таблица Из опцииРасчета Цикл
        сумма = сумма + объект[таблица.ИмяТЧ].Итог(таблица.Столбец);
    КонецЦикла;

    Возврат сумма;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
