#Область ОбработчикиСобытий

Процедура КлиентПодтвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЭтотОбъект.РегистрацияПодтверждена;
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
    Для каждого формируемаяЗадача Из ФормируемыеЗадачи Цикл
        наименованиеЗадачи = СтрШаблон("Получить согласие клиента ""%1"" на регистрацию",
            ЭтотОбъект.ДокументРегистрацииПользователя.Имя);
		формируемаяЗадача.Наименование  = наименованиеЗадачи;
		формируемаяЗадача.ДокументЗадачи = ЭтотОбъект.ДокументРегистрацииПользователя;
        формируемаяЗадача.ОписаниеЗадачи = "Описание задачи";
        формируемаяЗадача.ТипЗадачи = Перечисления.ТипыЗадачИсполнителя.РегистрацияПользователя;
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПометкаНаУдалениеДокументаРегистрацииОбработка(ТочкаМаршрутаБизнесПроцесса)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СозданиеНовогоПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
