#Область ОбработчикиСобытий

Процедура КлиентПодтвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
    Результат = ЭтотОбъект.РегистрацияПодтверждена;
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
    Для Каждого формируемаяЗадача Из ФормируемыеЗадачи Цикл
        наименованиеЗадачи = СтрШаблон("Получить согласие клиента ""%1"" на регистрацию",
                ЭтотОбъект.ДокументРегистрацииПользователя.Имя);
        формируемаяЗадача.Наименование = наименованиеЗадачи;
        формируемаяЗадача.ДокументЗадачи = ЭтотОбъект.ДокументРегистрацииПользователя;
        формируемаяЗадача.ОписаниеЗадачи = "Описание задачи";
        формируемаяЗадача.ТипЗадачи = Перечисления.ТипыЗадачИсполнителя.РегистрацияПользователя;
    КонецЦикла;
КонецПроцедуры

Процедура ПолучитьПодтверждениеРегистрацииПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
    Если ЭтотОбъект.РегистрацияПодтверждена И НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументРегистрацииПользователя.Идентификатор) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Поле ""Идентификатор"" документа регистрации пользователя должен быть заполнен уникальным значением.";
        Сообщение.Сообщить();
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры

Процедура ПометкаНаУдалениеДокументаРегистрацииОбработка(ТочкаМаршрутаБизнесПроцесса)
    ЭтотОбъект.ДокументРегистрацииПользователя.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
КонецПроцедуры

Процедура СозданиеНовогоПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
    Справочники.Пользователи.СоздатьПользователя(
        ЭтотОбъект.ДокументРегистрацииПользователя.Имя, ЭтотОбъект.ДокументРегистрацииПользователя.Идентификатор,
        Новый Структура("ЭтоКлиент", Истина));
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
