#Область ПрограммныйИнтерфейс

// Параметры:
//	массивЗначений - Массив - Массив значений колонки
//	имяКолонки - Строка
//	типЗначенийКолонки - Тип, Строка, ОписаниеТипов, Неопределено
//
// Возвращаемое значение:
//	ТаблицаЗначений
//
Функция КонвертироватьМассивВТаблицуЗначений(Знач массивЗначений, Знач имяКолонки, Знач типЗначенийКолонки = Неопределено) Экспорт
    // Блок диагностики аргументов
    диагностикаКонтекстПроверки = "Документы.ЗаписьКлиента.КонвертироватьМассивВТаблицуЗначений";

    ДиагностикаКлиентСервер.Утверждение(массивЗначений <> Неопределено И ТипЗнч(массивЗначений) = Тип("Массив"),
            СтрШаблон("Аргумент ""%1"" %2", "МассивЗначений", "имеет недопустимое значение или Неопределено"),
            диагностикаКонтекстПроверки);

    ДиагностикаКлиентСервер.Утверждение(имяКолонки <> Неопределено И ТипЗнч(имяКолонки) = Тип("Строка"),
            СтрШаблон("Аргумент ""%1"" %2", "ИмяКолонки", "имеет недопустимое значение или Неопределено"),
            диагностикаКонтекстПроверки);
    // Конец блока диагностики аргументов

    результатТЗ = Новый ТаблицаЗначений;
    описаниеТиповКолонки = Неопределено;
    Если ТипЗнч(типЗначенийКолонки) = Тип("ОписаниеТипов") Тогда
        описаниеТиповКолонки = типЗначенийКолонки;
    ИначеЕсли ТипЗнч(типЗначенийКолонки) = Тип("Тип") Тогда
        массивТиповКолонки = Новый Массив;
        массивТиповКолонки.Добавить(типЗначенийКолонки);
        описаниеТиповКолонки = Новый ОписаниеТипов(массивТиповКолонки);
    ИначеЕсли ТипЗнч(типЗначенийКолонки) = Тип("Строка") Тогда
        описаниеТиповКолонки = Новый ОписаниеТипов(типЗначенийКолонки);
    КонецЕсли;

    результатТЗ.Колонки.Добавить(имяКолонки, описаниеТиповКолонки);
    Для Каждого элемент Из массивЗначений Цикл
        стрТЗ = результатТЗ.Добавить();
        стрТЗ[имяКолонки] = элемент;
    КонецЦикла;

    Возврат результатТЗ;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
