#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(_, __)
    записатьАвтораДокументаНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область СлужебныеПроцедурыИФункции

// Записывает значение АвтораДокумента - как ТекущийПользователь при первой записи документа.\
// При повторных записях (если значение заполнено) АвтораДокумента не меняется
&НаСервере
Процедура записатьАвтораДокументаНаСервере()
    Объект.АвторДокумента = ?(ЗначениеЗаполнено(Объект.АвторДокумента),
            Объект.АвторДокумента, ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
