#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(данныеВыбора, __, стандартнаяОбработка)
    стандартнаяОбработка = Ложь;
    списокДоступныхЗначений = Новый СписокЗначений;
    Для Каждого значение Из Перечисления.ВидыОперацийПоступленияДенег Цикл
        Если значение <> Перечисления.ВидыОперацийПоступленияДенег.ПрочееПоступление Тогда
            списокДоступныхЗначений.Добавить(значение);
        КонецЕсли;
    КонецЦикла;
    данныеВыбора = списокДоступныхЗначений;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
