#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(_)
    Объект.Начисления.Очистить();
    началоПериода = НачалоМесяца(Объект.ПериодНачисления);
    конецПериода = КонецМесяца(Объект.ПериодНачисления);

    заполнитьТаблицуНачисленийНаСервере(началоПериода, конецПериода);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура заполнитьТаблицуНачисленийНаСервере(Знач началоПериода, Знач конецПериода)
    параметрыЗапроса = Новый Структура("НачалоПериода, КонецПериода",
            началоПериода, конецПериода);
    кадроваяИсторияСотрудников = РегистрыСведений.КадроваяИсторияСотрудников.ПолучитьКадровыеДанныеИнтервал(
            Неопределено, параметрыЗапроса, Истина);

    Если кадроваяИсторияСотрудников = Неопределено Тогда
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = "Кадровая история за период начисления отсутствует.";
        сообщение.Сообщить();

        Возврат; // Выход
    КонецЕсли;

    предСтрока = Неопределено;
    Для Каждого данныеСотрудника Из кадроваяИсторияСотрудников Цикл
        строкаНачисления = Объект.Начисления.Добавить();

        строкаНачисления.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад;
        строкаНачисления.Сотрудник = данныеСотрудника.Сотрудник;
        строкаНачисления.ГрафикРаботы = данныеСотрудника.ГрафикРаботы;
        строкаНачисления.ДатаНачала = Макс(началоПериода, данныеСотрудника.Период);
        строкаНачисления.ДатаОкончания = ?(строкаНачисления.Работает, конецПериода, данныеСотрудника.Период);
        строкаНачисления.ПоказательРасчета = данныеСотрудника.Оклад;

        Если предСтрока <> Неопределено И предСтрока.Сотрудник = данныеСотрудника.Сотрудник Тогда
            предСтрока.ДатаОкончания = строкаНачисления.ДатаНачала;
        КонецЕсли;

        предСтрока = строкаНачисления;
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
