#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(_, __)
    рассчитатьСуммуДокумента();
    записатьАвтораДокументаНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(_)
    текущСтрокаТовары = Элементы.Товары.ТекущиеДанные;
    Если НЕ текущСтрокаТовары.Номенклатура.Пустая() Тогда
        текущСтрокаТовары.ТипНоменклатуры = определитьТипНоменклатурыНаСервере(текущСтрокаТовары.Номенклатура);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(_)
    рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(_)
    рассчитатьСуммуПоСтрокеТовары();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТовары

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура рассчитатьСуммуПоСтрокеТовары()
    текущСтрокаТовары = Элементы.Товары.ТекущиеДанные;
    текущСтрокаТовары.Сумма = текущСтрокаТовары.Цена * текущСтрокаТовары.Количество;
    рассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммуДокумента()
    Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаСервере
Функция определитьТипНоменклатурыНаСервере(Знач номенклатураСсылка)
    Возврат номенклатураСсылка.ПолучитьОбъект().ТипНоменклатуры;
КонецФункции

// Записывает значение АвтораДокумента - как ТекущийПользователь при первой записи документа.\
// При повторных записях (если значение заполнено) АвтораДокумента не меняется
&НаСервере
Процедура записатьАвтораДокументаНаСервере()
    Объект.АвторДокумента = ?(ЗначениеЗаполнено(Объект.АвторДокумента),
            Объект.АвторДокумента, ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
