#Область ПрограммныйИнтерфейс

// Устарело. Необходимо вынести в константу.
//
// Возвращаемое значение:
//  - СправочникСсылка.Слады, Неопределено
Функция ПолучитьНаименованиеОсновногоСклада() Экспорт
    Возврат "Основной";
КонецФункции

// Возвращаемое значение:
//  - СправочникСсылка.Слады
Функция ПолучитьСкладПоУмолчанию() Экспорт
    складСсылка = ПолучитьНаименованиеОсновногоСклада();
    Если складСсылка = Неопределено ИЛИ НЕ ЗначениеЗаполнено(складСсылка) Тогда // Ошибка! отсутствует основной склад
        ВызватьИсключение "В справочнике Склады отсутствует основной склад.";
    КонецЕсли;

    Возврат ПолучитьСкладПоНаименованию(складСсылка);
КонецФункции

// Параметры:
//  наименованиеСклада - Строка
// Возвращаемое значение:
//  - СправочникСсылка.Слады, Неопределено
Функция ПолучитьСкладПоНаименованию(Знач наименованиеСклада) Экспорт
    запрос = Новый Запрос;
    запрос.УстановитьПараметр("НаименованиеСклада", наименованиеСклада);
    запрос.Текст =
        "ВЫБРАТЬ
        |   Склады.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.Склады КАК Склады
        |ГДЕ
        |   Склады.Наименование = &НаименованиеСклада
        |";

    результатЗапроса = запрос.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    выборка = результатЗапроса.Выбрать();
    выборка.Следующий();
    Возврат выборка.Ссылка;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
